# FERRAMENTAS

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("datas/BankChurners-analysis.csv", sep=";")

# Exploração dos dados

In [3]:
# verificando como o dataset está se comportando
data.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,...,1,3,"$12.691,00","$777,00","$11.914,00","1,34%",1144,42,"1,63%","0,06%"
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,...,1,2,"$8.256,00","$864,00","$7.392,00","1,54%",1291,33,"3,71%","0,11%"
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,1,0,"$3.418,00",$-,"$3.418,00","2,59%",1887,20,"2,33%","0,00%"
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,...,4,1,"$3.313,00","$2.517,00","$796,00","1,41%",1171,20,"2,33%","0,76%"
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,1,0,"$4.716,00",$-,"$4.716,00","2,18%",816,28,"2,50%","0,00%"

In [4]:
# verficar informações para entender as colunas
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10127 entries, 0 to 10126
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   CLIENTNUM                 10127 non-null  int64
 1   Attrition_Flag            10127 non-null  object
 2   Customer_Age              10127 non-null  int64
 3   Gender                    10127 non-null  object
 4   Dependent_count           10127 non-null  int64
 5   Education_Level           10127 non-null  object
 6   Marital_Status            10127 non-null  object
 7   Income_Category           10127 non-null  object
 8   Card_Category             10127 non-null  object
 9   Months_on_book            10127 non-null  int64
 10  Total_Relationship_Count  10127 non-null  int64
 11  Months_Inactive_12_mon    10127 non-null  int64
 12  Contacts_Count_12_mon     10127 non-null  int64
 13   Credit_Limit             10127 non-null  object
 14   Total_Revolving_Bal      10127 non-null  object
 15   Avg_Open_To_Buy          10127 non-null  object
 16  Total_Amt_Chng_Q4_Q1      10127 non-null  object
 17  Total_Trans_Amt           10127 non-null  int64
 18  Total_Trans_Ct            10127 non-null  int64
 19  Total_Ct_Chng_Q4_Q1       10127 non-null  object
 20  Avg_Utilization_Ratio     10127 non-null  object
dtypes: int64(9), object(12)
memory usage: 1.6+ MB

In [5]:
# removendo espaços em branco no nome das colunas
data = data.rename(columns=lambda x: x.strip())

In [19]:
# removendo espaços extras nos dados
data =  data.map(lambda x: x.strip() if isinstance(x, str) else x)

In [6]:
# uma verificada se os espaços extras nas variáveis foram retiradas
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10127 entries, 0 to 10126
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   CLIENTNUM                 10127 non-null  int64
 1   Attrition_Flag            10127 non-null  object
 2   Customer_Age              10127 non-null  int64
 3   Gender                    10127 non-null  object
 4   Dependent_count           10127 non-null  int64
 5   Education_Level           10127 non-null  object
 6   Marital_Status            10127 non-null  object
 7   Income_Category           10127 non-null  object
 8   Card_Category             10127 non-null  object
 9   Months_on_book            10127 non-null  int64
 10  Total_Relationship_Count  10127 non-null  int64
 11  Months_Inactive_12_mon    10127 non-null  int64
 12  Contacts_Count_12_mon     10127 non-null  int64
 13  Credit_Limit              10127 non-null  object
 14  Total_Revolving_Bal       10127 non-null  object
 15  Avg_Open_To_Buy           10127 non-null  object
 16  Total_Amt_Chng_Q4_Q1      10127 non-null  object
 17  Total_Trans_Amt           10127 non-null  int64
 18  Total_Trans_Ct            10127 non-null  int64
 19  Total_Ct_Chng_Q4_Q1       10127 non-null  object
 20  Avg_Utilization_Ratio     10127 non-null  object
dtypes: int64(9), object(12)
memory usage: 1.6+ MB

In [7]:
# As colunas 13, 14, 15 são moedas, precisamos formatá-las para conseguirmos fazer cálculos
data['Credit_Limit']

0         $12.691,00
1          $8.256,00
2          $3.418,00
3          $3.313,00
4          $4.716,00
             ...
10122      $4.003,00
10123      $4.277,00
10124      $5.409,00
10125      $5.281,00
10126     $10.388,00
Name: Credit_Limit, Length: 10127, dtype: object

#### Tranformação dos dados pois existem variáveis que deve estar como float

In [8]:
# VARIÁVEIS Total_Amt_Chng_Q4_Q1, Total_Ct_Chng_Q4_Q1, Avg_Utilization_Ratio SÃO DADOS COM PORCENTAGENS.
# VAMOS RENOMEAR A VARIÁVEL INCLUINDO O SÍMBOLO DE PORCENTAGEM E RETIRAR TODOS OS SÍMBOLOS DE PORCENTAGEM DOS DADOS
# DEPOIS VAMOS TRANSFORMAR PARA FLOAT

data = data.rename(columns={'Total_Amt_Chng_Q4_Q1': 'Total_Amt_Chng_Q4_Q1(%)', 'Total_Ct_Chng_Q4_Q1': 'Total_Ct_Chng_Q4_Q1(%)', 'Avg_Utilization_Ratio':'Avg_Utilization_Ratio(%)'})

In [11]:
# limpando símbolos de moeda e porcentagem para que fique no formato padrão para transformação 

data['Credit_Limit'] = data['Credit_Limit'].str.replace(' ', '').str.replace('$', '').str.replace('.', '')
data['Credit_Limit'] = data['Credit_Limit'].str.replace(',', '.')

data['Total_Revolving_Bal'] = data['Total_Revolving_Bal'].str.replace(' ', '').str.replace('$', '').str.replace('.', '')
data['Total_Revolving_Bal'] = data['Total_Revolving_Bal'].str.replace(',', '.')

data['Avg_Open_To_Buy'] = data['Avg_Open_To_Buy'].str.replace(' ', '').str.replace('$', '').str.replace('.', '')
data['Avg_Open_To_Buy'] = data['Avg_Open_To_Buy'].str.replace(',', '.')


data['Total_Amt_Chng_Q4_Q1(%)'] = data['Total_Amt_Chng_Q4_Q1(%)'].str.replace('%', '').str.replace(',', '.')
data['Total_Ct_Chng_Q4_Q1(%)'] = data['Total_Ct_Chng_Q4_Q1(%)'].str.replace('%', '').str.replace(',', '.')
data['Avg_Utilization_Ratio(%)'] = data['Avg_Utilization_Ratio(%)'].str.replace('%', '').str.replace(',', '.')

In [12]:
# Chegando para ver se os dados de moeda e porcentagens foram limpados corretamente
data.iloc[:, 13:21]

,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1(%),Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1(%),Avg_Utilization_Ratio(%)
0,1269100,77700,1191400,1.34,1144,42,1.63,0.06
1,825600,86400,739200,1.54,1291,33,3.71,0.11
2,341800,-,341800,2.59,1887,20,2.33,0.00
3,331300,251700,79600,1.41,1171,20,2.33,0.76
4,471600,-,471600,2.18,816,28,2.50,0.00
...,...,...,...,...,...,...,...,...
10122,400300,185100,215200,0.70,15476,117,0.86,0.46
10123,427700,218600,209100,0.80,8764,69,0.68,0.51
10124,540900,-,540900,0.82,10291,60,0.82,0.00
10125,528100,-,528100,0.54,8395,62,0.72,0.00
10126,1038800,196100,842700,0.70,10294,61,0.65,0.19

In [13]:
# tranformando dados de moeda e porcentagem para float
# o errors=coerce é para configurar para NaN caso não exista nenhum valor
data['Credit_Limit'] = pd.to_numeric(data['Credit_Limit'], errors='coerce')
data['Total_Revolving_Bal'] = pd.to_numeric(data['Total_Revolving_Bal'], errors='coerce')
data['Avg_Open_To_Buy'] = pd.to_numeric(data['Avg_Open_To_Buy'], errors='coerce')

data['Total_Amt_Chng_Q4_Q1(%)'] = pd.to_numeric(data['Total_Amt_Chng_Q4_Q1(%)'], errors='coerce')
data['Total_Ct_Chng_Q4_Q1(%)'] = pd.to_numeric(data['Total_Ct_Chng_Q4_Q1(%)'], errors='coerce')
data['Avg_Utilization_Ratio(%)'] = pd.to_numeric(data['Avg_Utilization_Ratio(%)'], errors='coerce')

In [14]:
# verificando se houve alteração
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10127 entries, 0 to 10126
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   CLIENTNUM                 10127 non-null  int64
 1   Attrition_Flag            10127 non-null  object
 2   Customer_Age              10127 non-null  int64
 3   Gender                    10127 non-null  object
 4   Dependent_count           10127 non-null  int64
 5   Education_Level           10127 non-null  object
 6   Marital_Status            10127 non-null  object
 7   Income_Category           10127 non-null  object
 8   Card_Category             10127 non-null  object
 9   Months_on_book            10127 non-null  int64
 10  Total_Relationship_Count  10127 non-null  int64
 11  Months_Inactive_12_mon    10127 non-null  int64
 12  Contacts_Count_12_mon     10127 non-null  int64
 13  Credit_Limit              10127 non-null  int64
 14  Total_Revolving_Bal       7657 non-null   float64
 15  Avg_Open_To_Buy           10127 non-null  int64
 16  Total_Amt_Chng_Q4_Q1(%)   10127 non-null  float64
 17  Total_Trans_Amt           10127 non-null  int64
 18  Total_Trans_Ct            10127 non-null  int64
 19  Total_Ct_Chng_Q4_Q1(%)    10127 non-null  float64
 20  Avg_Utilization_Ratio(%)  10127 non-null  float64
dtypes: float64(4), int64(11), object(6)
memory usage: 1.6+ MB

In [20]:
# verificando comos os dados estão
data.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1(%),Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1(%),Avg_Utilization_Ratio(%)
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,...,1,3,1269100,77700.0,1191400,1.34,1144,42,1.63,0.06
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,...,1,2,825600,86400.0,739200,1.54,1291,33,3.71,0.11
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,1,0,341800,NaN,341800,2.59,1887,20,2.33,0.00
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,...,4,1,331300,251700.0,79600,1.41,1171,20,2.33,0.76
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,1,0,471600,NaN,471600,2.18,816,28,2.50,0.00

#### Verificando se há duplicações

In [30]:
data.duplicated().sum()

0

#### Verificando se há valores nulos

In [29]:

data.isnull().sum()

CLIENTNUM                      0
Attrition_Flag                 0
Customer_Age                   0
Gender                         0
Dependent_count                0
Education_Level                0
Marital_Status                 0
Income_Category                0
Card_Category                  0
Months_on_book                 0
Total_Relationship_Count       0
Months_Inactive_12_mon         0
Contacts_Count_12_mon          0
Credit_Limit                   0
Total_Revolving_Bal         2470
Avg_Open_To_Buy                0
Total_Amt_Chng_Q4_Q1(%)        0
Total_Trans_Amt                0
Total_Trans_Ct                 0
Total_Ct_Chng_Q4_Q1(%)         0
Avg_Utilization_Ratio(%)       0
dtype: int64

In [34]:
# obtendo mais detalhes 
data[data.isnull().any(axis=1)]

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1(%),Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1(%),Avg_Utilization_Ratio(%)
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,1,0,341800,NaN,341800,2.59,1887,20,2.33,0.0
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,1,0,471600,NaN,471600,2.18,816,28,2.50,0.0
12,710599683,Existing Customer,56,M,1,College,Single,$80K - $120K,Blue,36,...,6,0,1175100,NaN,1175100,3.40,1539,17,3.25,0.0
21,708508758,Attrited Customer,62,F,0,Graduate,Married,Less than $40K,Blue,49,...,3,3,143830,NaN,143830,1.05,692,16,0.60,0.0
24,789124683,Existing Customer,54,M,2,Unknown,Married,$80K - $120K,Blue,42,...,2,3,1221700,NaN,1221700,1.08,1110,21,0.75,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10109,780613758,Existing Customer,47,M,5,High School,Single,Less than $40K,Blue,35,...,3,5,416500,NaN,416500,0.81,17093,111,0.82,0.0
10112,708564858,Attrited Customer,33,M,2,College,Married,$120K +,Gold,20,...,1,4,3451600,NaN,3451600,1.00,9338,73,0.62,0.0
10114,720841533,Existing Customer,29,M,0,Graduate,Married,Less than $40K,Blue,15,...,1,5,470000,NaN,470000,0.62,14723,96,0.66,0.0
10124,716506083,Attrited Customer,44,F,1,High School,Married,Less than $40K,Blue,36,...,3,4,540900,NaN,540900,0.82,10291,60,0.82,0.0
10125,717406983,Attrited Customer,30,M,2,Graduate,Unknown,$40K - $60K,Blue,36,...,3,3,528100,NaN,528100,0.54,8395,62,0.72,0.0

In [ ]:
# Os valores que estão como NaN estavam configurado como "-" precisei alternar para NaN com corce na sessão para que a função tivesse efeito
# ->> limpando símbolos de moeda e porcentagem para que fique no formato padrão para transformação <-- #
# Como o valor estava configurado com "-" irei dá-los o valor nulo como 0

data['Total_Revolving_Bal'] = data['Total_Revolving_Bal'].ffill()

TypeError: NDFrame.ffill() takes 1 positional argument but 2 were given